
========================================
Info for: VGG16 - vgg16.pth
========================================
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
├─Sequential: 1-1                        [-1, 512, 1, 1]           --
|    └─Conv2d: 2-1                       [-1, 64, 32, 32]          1,792
|    └─ReLU: 2-2                         [-1, 64, 32, 32]          --
|    └─Conv2d: 2-3                       [-1, 64, 32, 32]          36,928
|    └─ReLU: 2-4                         [-1, 64, 32, 32]          --
|    └─MaxPool2d: 2-5                    [-1, 64, 16, 16]          --
|    └─Conv2d: 2-6                       [-1, 128, 16, 16]         73,856
|    └─ReLU: 2-7                         [-1, 128, 16, 16]         --
|    └─Conv2d: 2-8                       [-1, 128, 16, 16]         147,584
|    └─ReLU: 2-9                         [-1, 128, 16, 16]         --
|    └─MaxPool2d: 2-10                   [-1, 128, 8, 8]           --
|    └─Conv2d: 2-11                      [-1, 256, 8, 8]           295,168
|    └─ReLU: 2-12                        [-1, 256, 8, 8]           --
|    └─Conv2d: 2-13                      [-1, 256, 8, 8]           590,080
|    └─ReLU: 2-14                        [-1, 256, 8, 8]           --
|    └─Conv2d: 2-15                      [-1, 256, 8, 8]           590,080
|    └─ReLU: 2-16                        [-1, 256, 8, 8]           --
|    └─MaxPool2d: 2-17                   [-1, 256, 4, 4]           --
|    └─Conv2d: 2-18                      [-1, 512, 4, 4]           1,180,160
|    └─ReLU: 2-19                        [-1, 512, 4, 4]           --
|    └─Conv2d: 2-20                      [-1, 512, 4, 4]           2,359,808
|    └─ReLU: 2-21                        [-1, 512, 4, 4]           --
|    └─Conv2d: 2-22                      [-1, 512, 4, 4]           2,359,808
|    └─ReLU: 2-23                        [-1, 512, 4, 4]           --
|    └─MaxPool2d: 2-24                   [-1, 512, 2, 2]           --
|    └─Conv2d: 2-25                      [-1, 512, 2, 2]           2,359,808
|    └─ReLU: 2-26                        [-1, 512, 2, 2]           --
|    └─Conv2d: 2-27                      [-1, 512, 2, 2]           2,359,808
|    └─ReLU: 2-28                        [-1, 512, 2, 2]           --
|    └─Conv2d: 2-29                      [-1, 512, 2, 2]           2,359,808
|    └─ReLU: 2-30                        [-1, 512, 2, 2]           --
|    └─MaxPool2d: 2-31                   [-1, 512, 1, 1]           --
|    └─AdaptiveAvgPool2d: 2-32           [-1, 512, 1, 1]           --
├─Sequential: 1-2                        [-1, 10]                  --
|    └─Linear: 2-33                      [-1, 4096]                2,101,248
|    └─ReLU: 2-34                        [-1, 4096]                --
|    └─Dropout: 2-35                     [-1, 4096]                --
|    └─Linear: 2-36                      [-1, 4096]                16,781,312
|    └─ReLU: 2-37                        [-1, 4096]                --
|    └─Dropout: 2-38                     [-1, 4096]                --
|    └─Linear: 2-39                      [-1, 10]                  40,970
==========================================================================================
Total params: 33,638,218
Trainable params: 33,638,218
Non-trainable params: 0
Total mult-adds (M): 365.74
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 2.17
Params size (MB): 128.32
Estimated Total Size (MB): 130.50
==========================================================================================
FLOPs (MACs): 333.22 MMac
Params: 33.64 M
Average Inference Time: 1.53 ms
