
========================================
Info for: AllConv - allconv_original_acc.pth
========================================
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
├─Sequential: 1-1                        [-1, 10, 1, 1]            --
|    └─Conv2d: 2-1                       [-1, 96, 32, 32]          2,688
|    └─ReLU: 2-2                         [-1, 96, 32, 32]          --
|    └─Conv2d: 2-3                       [-1, 96, 32, 32]          83,040
|    └─ReLU: 2-4                         [-1, 96, 32, 32]          --
|    └─Conv2d: 2-5                       [-1, 96, 16, 16]          83,040
|    └─ReLU: 2-6                         [-1, 96, 16, 16]          --
|    └─Dropout: 2-7                      [-1, 96, 16, 16]          --
|    └─Conv2d: 2-8                       [-1, 192, 16, 16]         166,080
|    └─ReLU: 2-9                         [-1, 192, 16, 16]         --
|    └─Conv2d: 2-10                      [-1, 192, 16, 16]         331,968
|    └─ReLU: 2-11                        [-1, 192, 16, 16]         --
|    └─Conv2d: 2-12                      [-1, 192, 8, 8]           331,968
|    └─ReLU: 2-13                        [-1, 192, 8, 8]           --
|    └─Dropout: 2-14                     [-1, 192, 8, 8]           --
|    └─Conv2d: 2-15                      [-1, 192, 8, 8]           331,968
|    └─ReLU: 2-16                        [-1, 192, 8, 8]           --
|    └─Conv2d: 2-17                      [-1, 192, 8, 8]           37,056
|    └─ReLU: 2-18                        [-1, 192, 8, 8]           --
|    └─Conv2d: 2-19                      [-1, 10, 8, 8]            1,930
|    └─AdaptiveAvgPool2d: 2-20           [-1, 10, 1, 1]            --
==========================================================================================
Total params: 1,369,738
Trainable params: 1,369,738
Non-trainable params: 0
Total mult-adds (M): 282.54
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 2.72
Params size (MB): 5.23
Estimated Total Size (MB): 7.96
==========================================================================================
FLOPs (MACs): 282.24 MMac
Params: 1.37 M
Average Inference Time: 0.55 ms
