
========================================
Info for: NiN - nin_original_acc.pth
========================================
==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
├─Sequential: 1-1                        [-1, 96, 16, 16]          --
|    └─Conv2d: 2-1                       [-1, 192, 32, 32]         14,592
|    └─ReLU: 2-2                         [-1, 192, 32, 32]         --
|    └─Conv2d: 2-3                       [-1, 160, 32, 32]         30,880
|    └─ReLU: 2-4                         [-1, 160, 32, 32]         --
|    └─Conv2d: 2-5                       [-1, 96, 32, 32]          15,456
|    └─ReLU: 2-6                         [-1, 96, 32, 32]          --
|    └─MaxPool2d: 2-7                    [-1, 96, 16, 16]          --
|    └─Dropout: 2-8                      [-1, 96, 16, 16]          --
├─Sequential: 1-2                        [-1, 192, 8, 8]           --
|    └─Conv2d: 2-9                       [-1, 192, 16, 16]         460,992
|    └─ReLU: 2-10                        [-1, 192, 16, 16]         --
|    └─Conv2d: 2-11                      [-1, 192, 16, 16]         921,792
|    └─ReLU: 2-12                        [-1, 192, 16, 16]         --
|    └─Conv2d: 2-13                      [-1, 192, 16, 16]         921,792
|    └─ReLU: 2-14                        [-1, 192, 16, 16]         --
|    └─AvgPool2d: 2-15                   [-1, 192, 8, 8]           --
|    └─Dropout: 2-16                     [-1, 192, 8, 8]           --
├─Sequential: 1-3                        [-1, 10, 1, 1]            --
|    └─Conv2d: 2-17                      [-1, 192, 8, 8]           331,968
|    └─ReLU: 2-18                        [-1, 192, 8, 8]           --
|    └─Conv2d: 2-19                      [-1, 192, 8, 8]           37,056
|    └─ReLU: 2-20                        [-1, 192, 8, 8]           --
|    └─Conv2d: 2-21                      [-1, 10, 8, 8]            1,930
|    └─ReLU: 2-22                        [-1, 10, 8, 8]            --
|    └─AvgPool2d: 2-23                   [-1, 10, 1, 1]            --
==========================================================================================
Total params: 2,736,458
Trainable params: 2,736,458
Non-trainable params: 0
Total mult-adds (M): 678.21
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 4.82
Params size (MB): 10.44
Estimated Total Size (MB): 15.27
==========================================================================================
FLOPs (MACs): 677.66 MMac
Params: 2.74 M
Average Inference Time: 0.63 ms
